# parameters — 3-B variants (BCE heat + EDL dual, 3-channel Segmenter)
nc: 10  # number of classes

depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
# anchors  1536
anchors:
  - [6,8,    10,22,  19,15]  # P3/8
  - [19,32,  39,22,  32,47]  # P4/16
  - [74,38,  65,74,  136,112]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],

   [-1, 1, DWConv, [256, 13, 1]],
   [[-1], 1, Segmenter, [3]], # 3-ch dual: ch0 = BCE heat logit (original ESOD heat preserved), ch1-2 = EDL Dirichlet (bg/obj evidence)
   [[4, -1], 1, HeatMapParser, [256, 8, 0.5]],  # 7, threshold default 0.5 (BCE-prob-like fused output); overridable by ESOD_HM_THRES

   [-1, 1, Conv, [512, 3, 2]],  # 8-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 10-P5/32
   [-1, 1, SPP, [1024, [3, 5, 7]]],
   [-1, 3, C3, [1024, False]],  # 12
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 23 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],  # 26 (P5/32-large)

   [[20, 23, 26], 1, Detect, [nc, anchors]],
  ]
